## Staging: pinpoint_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                         |
|--------|--------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.pinpoint-sms-blocked-as-spam[0]`                   |
|        | `aws_cloudwatch_log_metric_filter.pinpoint-sms-failures[0]`                          |
|        | `aws_cloudwatch_log_metric_filter.pinpoint-sms-phone-carrier-unavailable[0]`         |
|        | `aws_cloudwatch_log_metric_filter.pinpoint-sms-rate-exceeded[0]`                     |
|        | `aws_cloudwatch_log_metric_filter.pinpoint-sms-successes[0]`                         |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning[0]`                |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-warning[0]`      |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-warning[0]`                  |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-critical[0]` |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-warning[0]`                   |
|        | `aws_cloudwatch_metric_alarm.total-sms-spending-critical[0]`                         |
|        | `aws_cloudwatch_metric_alarm.total-sms-spending-warning[0]`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-blocked-as-spam[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-blocked-as-spam" {
      + id             = (known after apply)
      + log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure"
      + name           = "pinpoint-sms-blocked-as-spam"
      + pattern        = "{ $.messageStatus = \"SPAM\" }"

      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-blocked-as-spam"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-failures[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-failures" {
      + id             = (known after apply)
      + log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure"
      + name           = "pinpoint-sms-failures"
      + pattern        = "{ ($.isFinal IS TRUE) && ( ($.messageStatus != \"SUCCESSFUL\") && ($.messageStatus != \"DELIVERED\") ) }"

      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-failures"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-phone-carrier-unavailable[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-phone-carrier-unavailable" {
      + id             = (known after apply)
      + log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure"
      + name           = "pinpoint-sms-phone-carrier-unavailable"
      + pattern        = "{ $.messageStatus = \"CARRIER_UNREACHABLE\" }"

      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-phone-carrier-unavailable"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-rate-exceeded[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-rate-exceeded" {
      + id             = (known after apply)
      + log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure"
      + name           = "pinpoint-sms-rate-exceeded"
      + pattern        = "{ $.messageStatusDescription = \"Rate exceeded.\" }"

      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-rate-exceeded"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-successes[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-successes" {
      + id             = (known after apply)
      + log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber"
      + name           = "pinpoint-sms-successes"
      + pattern        = "{ ($.isFinal IS TRUE) && ( ($.messageStatus = \"SUCCESSFUL\") || ($.messageStatus = \"DELIVERED\") ) }"

      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-successes"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-blocked-as-spam-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "More than 10 Pinpoint SMS have been blocked as spam over 12 hours"
      + alarm_name                            = "pinpoint-sms-blocked-as-spam-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-blocked-as-spam"
      + namespace                             = "LogMetrics"
      + period                                = 43200
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-phone-carrier-unavailable-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "More than 100 Pinpoint SMS failed because a phone carrier is unavailable over 3 hours"
      + alarm_name                            = "pinpoint-sms-phone-carrier-unavailable-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-phone-carrier-unavailable"
      + namespace                             = "LogMetrics"
      + period                                = 10800
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-rate-exceeded-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "At least 1 Pinpoint SMS rate exceeded error in 5 minutes"
      + alarm_name                            = "pinpoint-sms-rate-exceeded-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-rate-exceeded"
      + namespace                             = "LogMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-canadian-numbers-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Pinpoint SMS success rate to Canadian numbers is below 25% over 2 consecutive periods of 12 hours"
      + alarm_name                            = "pinpoint-sms-success-rate-canadian-numbers-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 0.25
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "failures"
          + return_data = false

          + metric {
              + metric_name = "pinpoint-sms-failures"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "successes"
          + return_data = false

          + metric {
              + metric_name = "pinpoint-sms-successes"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "successes / (successes + failures)"
          + id          = "success_rate"
          + label       = "Success Rate"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS success rate is below 60% over 2 consecutive periods of 12 hours"
      + alarm_name                            = "pinpoint-sms-success-rate-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 0.6
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "failures"
          + return_data = false

          + metric {
              + metric_name = "pinpoint-sms-failures"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "successes"
          + return_data = false

          + metric {
              + metric_name = "pinpoint-sms-successes"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "successes / (successes + failures)"
          + id          = "success_rate"
          + label       = "Success Rate"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.total-sms-spending-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "total-sms-spending-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "SMS spending reached 90% of limit this month"
      + alarm_name                            = "total-sms-spending-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 0.9
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "pinpoint_spend"
          + return_data = false

          + metric {
              + metric_name = "TextMessageMonthlySpend"
              + namespace   = "AWS/SMSVoice"
              + period      = 300
              + stat        = "Maximum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "sns_spend"
          + return_data = false

          + metric {
              + metric_name = "SMSMonthToDateSpentUSD"
              + namespace   = "AWS/SNS"
              + period      = 300
              + stat        = "Maximum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "sns_spend + pinpoint_spend"
          + id          = "total_spend"
          + label       = "Total SMS Monthly Spend"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.total-sms-spending-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "total-sms-spending-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "SMS spending reached 80% of limit this month"
      + alarm_name                            = "total-sms-spending-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 0.8
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "pinpoint_spend"
          + return_data = false

          + metric {
              + metric_name = "TextMessageMonthlySpend"
              + namespace   = "AWS/SMSVoice"
              + period      = 300
              + stat        = "Maximum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "sns_spend"
          + return_data = false

          + metric {
              + metric_name = "SMSMonthToDateSpentUSD"
              + namespace   = "AWS/SNS"
              + period      = 300
              + stat        = "Maximum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "sns_spend + pinpoint_spend"
          + id          = "total_spend"
          + label       = "Total SMS Monthly Spend"
          + return_data = true
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_to_sqs_sms_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.total-sms-spending-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.total-sms-spending-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pinpoint_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pinpoint_logs"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
